In [3]:
import pandas as pd
import numpy as np
Portland_families = pd.read_csv("portland_families.csv")
Portland_families.head()

,householdID,total_ppl,own_rent,square_foot,household_income,number_pets,county,entertainment_spend_est,travel_spend_est,under_12,LL_passholder
0,1,3,own,3309,80464,1,York,2535,2842,1,No
1,2,3,own,3814,47696,2,York,2913,3938,1,No
2,3,3,rent,2592,108256,2,Cumberland,1986,3687,2,No
3,4,2,own,2628,68064,1,Cumberland,2505,2826,1,No
4,5,3,rent,2442,62786,2,Sagadahoc,3541,1344,2,No

We will remove the household ID column as this may not be required in the analysis.

Let's ensure that the dataset doesn't contain any NaN value.

In [4]:
Portland_families.isnull().values.any()

False